# Pandas II - Data Cleaning

_September 17, 2020_

Agenda today:
- Introduction to lambda function
- Introduction to data cleaning in pandas
- Combining DataFrames
- Optional Exercises

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Part I. Lambda function
lambda functions are known as anonymous functions in Python. It allows you to write one-line functions that are used together with `map()`, `filter()`.

Syntax of lambda function: `lambda arguments:expressions`.

In [2]:
# lambda function with one argument
# add 10 to a number
func_1 = lambda x:x+10
func_1(10)

20

In [ ]:
(lambda x:x+10)(10)

In [ ]:
# lambda function with multiple arguments
func_2 = lambda x, y, z: x+y+z if z + y > x else x-y+z
func_2(10,12,10)

In [3]:
(lambda x,y,z: x+y+z)(10,5,1)

16

In [ ]:
map(function, collection)
filter(function, collection) #only returns elements that satisfy the function

In [12]:
# exercise: turn the below function into a lambda function
def count_zeros(li):
    """
    return a count of how many zeros are in a list
    """
    count = sum(x == 0 for x in li)
    return count

In [13]:
#### my solution to excercise using map or filter
li = [1,2,4,0]
sum(map(lambda x: x == 0, li))

1

In [15]:
#### cohort solution
li = [1,2,4,0]
len(list(filter(lambda x:x==0,li)))

1

In [14]:
count_zeros([1,2,4,0])

1

In [ ]:
#necessary components
map(function, collection)
filter(function, collection)

In [ ]:
# your answer here
sum(list(map(lambda x:x == 0,[1,2,4,0])))

## Part II. Data Cleaning in Pandas
You might wonder what the usage of lambda functions are - they are incredibly useful when applied to data cleaning in Pandas. You can apply it to columns or the entire dataframe to get results you need. For example, you might want to convert a column with $USD to Euros, or temperature expressed in Celsius to Fehrenheit. You will learn three new functions:

- `Apply()` - on both series and dataframe

- `Applymap()` - only on dataframes

- `Map()` - only on series

In [17]:
# import the dataframe 
df = pd.read_csv('auto-mpg.csv')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [33]:
# examine the first few rows of it 
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons_bc,age
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465,50

In [18]:
# check the datatypes of the df
df.info() #or df.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      398 non-null object
weight          398 non-null int64
acceleration    398 non-null float64
model year      398 non-null int64
origin          398 non-null int64
car name        398 non-null object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [19]:
# check whether you have missing values
df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [ ]:
# creating new columns - broadcasting

In [ ]:
# check the dataframe

In [25]:
# time to use lambda and apply! with apply, applymap, and map, you never need to "iterate through the rows"

# create a function that takes in the weight as lbs, and return weight in tons 

# 1 lb = 0.0005 tons
#lambda - can chain 
df['weight_in_tons'] = df['weight'].apply(lambda x: x*0.0005)
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons_bc
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465

In [24]:
#broadcasting - much faster

df['weight_in_tons_bc'] = df['weight']*0.0005
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons_bc
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465

In [31]:
# exercise - create a new column called "years old", which determines how old a car is 
###lambda
df['age'] = df['model year'].apply(lambda x:120-x)
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons_bc,age
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465,50

In [32]:
# exercise - create a new column called "years old", which determines how old a car is 
###broadcasting
df['age'] = abs(df['model year'] - 120)
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,weight_in_tons,weight_in_tons_bc,age
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520,50
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465,50

## Part III. Combining DataFrames in Pandas
There are two methods in Pandas that allow us to combine our DataFrames:

    - df.merge() - allow us to match dataframes on either indices or columns
    - df.concat() - allow us to concatenate two dataframes vertically or horizontally 
    
 what is df.join()? > it's built on top of df.merg().... so df.merge() you can do anythinig you coud do in df.join()

In [2]:
# create some toy dataframes 
import pandas as pd
import numpy as np
small_grades = pd.DataFrame({"students":["Amelia","Justin W","Brendan"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_quiz = pd.DataFrame({"students":["Billy","Cierra","Justin W"],
                            "quiz_score":np.random.randint(0,10,3)})

In [4]:
print(small_grades)
print(small_quiz)

   students  projects  grades
0    Amelia         1      95
1  Justin W         2      91
2   Brendan         1      87
   students  quiz_score
0     Billy           8
1    Cierra           7
2  Justin W           5

In [6]:
### df.concat combining 2 dataframe together.. either vertically or horizontally
## vertical - join along the rows
## 

combined = pd.concat([small_grades, small_quiz], axis = 1)
combined

   students  projects  grades  students  quiz_score
0    Amelia         1      95     Billy           8
1  Justin W         2      91    Cierra           7
2   Brendan         1      87  Justin W           5

In [ ]:
### df.merge - same as joining in sql (and logic is the same)
## interview question! what are the different types of join?

<img src = 'sql-joins.png' width = 400>

Based on the diagram above, what are the differences of different types of merge?

In [7]:
### df.merge

# inner merge
small_grades.merge(small_quiz, on = 'students')

   students  projects  grades  quiz_score
0  Justin W         2      91           5

In [8]:
# outer merge
small_grades.merge(small_quiz, how = 'outer', on = 'students')

   students  projects  grades  quiz_score
0    Amelia       1.0    95.0         NaN
1  Justin W       2.0    91.0         5.0
2   Brendan       1.0    87.0         NaN
3     Billy       NaN     NaN         8.0
4    Cierra       NaN     NaN         7.0

In [12]:
# right merge
small_grades.merge(small_quiz, how = 'right', on = 'students')

   students  projects  grades  quiz_score
0  Justin W       2.0    91.0           5
1     Billy       NaN     NaN           8
2    Cierra       NaN     NaN           7

### Data Cleaning - level up with the adult dataset

Dataset documentation:
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

In [ ]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
adults = pd.read_csv(url,header = None)

In [ ]:
# Check the first few rows

In [ ]:
# add the columns to dataset
columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status','occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country','income']

In [ ]:
# check the info of dataset

In [ ]:
# check missing values

In [ ]:
# perform some queries - find the total num female & bachelors

In [ ]:
# seems like we have data anolmaly, find out what that is and fix it 
# hint - tons of entries contain white space, remove it!

In [ ]:
# subsetting multiple cols

In [ ]:
# create a column called income_binary, 1 if >50k and 0 otherwise

In [ ]:
# get some descriptive statistics of the income distribution